package ex4_operator;

public class Ex1_oper {
    public static void main(String[] args) {
        
        //연산자(operator) *외울것
        //1.최고연산자 : . , ()
        //2.증감연산자 : ++ , --
        //3.산술연산자 : + , - , * , / , %
        //4.시프트연산자 : >> , << , >>>
        //5.비교연산자 : > , < , >= , <== , == , !=
        //6.비트연산자 : & , |(Shift+\) , ^ , ~
        //7.논리연산자 : && , || , !
        //8.삼향(조건)연산자 : ? , :
        //9.대입연산자 : = , *= , /= , %= , += , -=

        //1.산술연산자
        int n1 = 20;
        int n2 = 7;
        int n3 = n1 + n2;
        System.out.println("+연산 : "+ n3);

        n3 = n1 / n2;
        System.out.println("/연산 :"+ n3); //20나누기 7로 2.857...등으로 나와야하나 int는 정수만 표현되기 때문에 '2'로 출력

        n3 = n1 % n2;
        System.out.println("%연산 :"+ n3); //20나누기 7의 몫이 2이고, 나머지가 6이므로 '6'이 출력 (6*2=18+2.857...=20 이니까)
        
    
    }
}
