package ex1_string;

public class Ex4_string {
    public static void main(String[] args) {
        
        //1~9사이의 중복되지 않는 난수 3개를 만든다
        //com = 641
        //입력 >> 617
        //asnser : 1 스트라이크 / 1볼  [아무것도 일치않으면 아웃]
        //3스트라이크가 나오면 정답
        //n회 정답! - 142
          
    // 세자리 수를 입력하세요(예:123) - 123
    // 1Strike, 1Ball
    // --------------------------
    // 세자리 수를 입력하세요(예:123) - 567
    // OUT!!
    // --------------------------
    // 세자리 수를 입력하세요(예:123) - 214
    // 0Strike, 3Ball
    // --------------------------
    // 세자리 수를 입력하세요(예:123) - 142
    // 4회 정답 !! - 142
       

    

    }//main
}
